cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'go'
brew 'grc'
brew 'hipchat'
brew 'imagemagick'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'pyenv'
brew 'python3'
brew 'terraform'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Network utils
brew 'nmap'
brew 'wget'

# GUI Applications
cask 'adobe-reader'
cask 'atom'
cask 'cyberduck'
cask 'firefox'
cask 'github-desktop'
cask 'gitter'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'staruml'
cask 'textual'
cask 'virtualbox'
