cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'awscli'
brew 'coreutils'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'openssl'
brew 'nvm'
brew 'readline'
brew 'pass'
brew 'postgresql'
brew 'pyenv'
brew 'python3'
brew 'terraform'

# Golang
brew 'go'
brew 'glide'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Network utils
brew 'nmap'
brew 'wget'

# Docker stuff
brew 'qemu'
brew 'docker-clean'

# Other VCS tools (Used with go)
brew 'bazaar'
brew 'hg'

# GUI Applications
cask 'adobe-reader'
cask 'atom'
cask 'cyberduck'
cask 'firefox'
cask 'github-desktop'
cask 'gitter'
cask 'hipchat'
cask 'google-chrome'
cask 'pgadmin3'
cask 'slack'
cask 'spotify'
cask 'staruml'
cask 'textual'
cask 'virtualbox'
